In [1]:
import pandas as pd
import numpy as np

In [5]:
data={
    'Name' :["harakh","hiren","mitesh",None,"jay"],
    'Age':[10,20,None,40,30],
    'City' :["surendaranagar","muli","dholka","jamnagar","rajkot"],
    'company' :[None,None,None,None,None]
}

In [7]:
df = pd.DataFrame(data)

In [9]:
df

     Name   Age            City company
0  harakh  10.0  surendaranagar    None
1   hiren  20.0            muli    None
2  mitesh   NaN          dholka    None
3    None  40.0        jamnagar    None
4     jay  30.0          rajkot    None

In [23]:
#that's is prinit no any nan values in this column
No_nan_values=df.dropna(axis=1)

In [25]:
No_nan_values

             City
0  surendaranagar
1            muli
2          dholka
3        jamnagar
4          rajkot

In [29]:
# check the nan value in row and column 
Nan_values=df.isna()

In [31]:
Nan_values

    Name    Age   City  company
0  False  False  False     True
1  False  False  False     True
2  False   True  False     True
3   True  False  False     True
4  False  False  False     True

In [53]:
#drop the nan value column in the dataset 
drop_nan_values=df.dropna(axis=1)

In [55]:
drop_nan_values

             City
0  surendaranagar
1            muli
2          dholka
3        jamnagar
4          rajkot